## 1.0 Business Understanding

Microsoft, a prominent force in the global technology sector, is expanding its horizons by venturing into the entertainment industry with the establishment of a new movie studio. This endeavor seeks to capitalize on Microsoft's extensive resources, widespread influence, and innovative prowess to develop compelling and unique films, thereby broadening its range of offerings.

# Domain of the Business

The domain of this business venture is the film and entertainment industry. Microsoft intends to produce, distribute, and promote movies for theatrical release and streaming platforms.

# Business Objective

To build a thriving movie studio that creates entertaining and captivating films, resonating with a broad spectrum of audiences and driving profitable returns

# Data Understanding

This dataset comprises two main tables. The first table has 6 columns. These columns provide information about various movies, including their titles, release years, durations, genres, and ratings.

The second dataset contains 6 columns. This table focuses on financial aspects, including production budgets, domestic and worldwide gross earnings, and release dates.

The analysis contains the following:
1. Business Understanding
2. Importing libraries and datasets
3. Previewing the datasets
4. Data Cleaning
5. Exploratory data analysis(Univeriate, Bivariate and Multivariate)
6. Summary
7. Recommendations

## 2.0 Importing Data

In [47]:
# We begin by importing the relevant libraries that will be used
import matplotlib.pyplot as plt 
import sqlite3
import pandas as pd

In [48]:
data=pd.read_csv("bom.movie_gross.csv")

In [49]:
data

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

In [50]:
imdb=r"/Users/mitchmathiu/projects/phase/Movie-Project/im.db"
conn=sqlite3.connect(imdb)

## 3.0 Preview of Information in the data

Here we just want to have a look at whats contained in the IMDB dataset and just have a proper feel of whats contained in the dataset

In [51]:
#from the imdb database we first want to know the names and number of the tables.
query0=("""
    SELECT name
    AS 'Table_Name'
    FROM sqlite_master
    WHERE type = 'table'
;
""")
pd.read_sql(query0,conn)

      Table_Name
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

In [52]:
# checking for the information contained in the movie basics table
query1 = ("""
    SELECT * 
    FROM movie_basics
    ;
          """)
df = pd.read_sql(query1,conn)
df.head()

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [53]:
# checking for the information contained in the movie ratings table
query1 = ("""
    SELECT * 
    FROM movie_ratings
    ;
          """)
df1 = pd.read_sql(query1,conn)
df1.head()

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [54]:
df=pd.concat([df,df1])

In [55]:
df

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,Sunghursh,2013.0,175.0,"Action,Crime,Drama",NaN,NaN
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019.0,114.0,"Biography,Drama",NaN,NaN
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018.0,122.0,Drama,NaN,NaN
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018.0,NaN,"Comedy,Drama",NaN,NaN
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017.0,80.0,"Comedy,Drama,Fantasy",NaN,NaN
...,...,...,...,...,...,...,...,...
73851,tt9805820,NaN,NaN,NaN,NaN,NaN,8.1,25.0
73852,tt9844256,NaN,NaN,NaN,NaN,NaN,7.5,24.0
73853,tt9851050,NaN,NaN,NaN,NaN,NaN,4.7,14.0
73854,tt9886934,NaN,NaN,NaN,NaN,NaN,7.0,5.0
73855,tt9894098,NaN,NaN,NaN,NaN,NaN,6.3,128.0

To get the preview of information from the data in a simplified way, we will define another function that will help do so

In [56]:
def dataframe_preview(df):
    #To get the shape of the dataframe
    print("The shape of the dataframe:")
    print(df.shape)
    print('\n')
    #To get the info of the dataframe
    print("The data in the dataframe:")
    print(df.info())
    print('\n')
    #To get the descriptive statistics of the dataframe
    print("The descriptive stats of the df:")
    print(df.describe())
    #To get the columns of the dataframe
    print("The columns of the dataframe are:")
    print(df.columns)

In [57]:
dataframe_preview(df)

The shape of the dataframe:
(220000, 8)


The data in the dataframe:
<class 'pandas.core.frame.DataFrame'>
Index: 220000 entries, 0 to 73855
Data columns (total 8 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   movie_id         220000 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  float64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
 6   averagerating    73856 non-null   float64
 7   numvotes         73856 non-null   float64
dtypes: float64(4), object(4)
memory usage: 15.1+ MB
None


The descriptive stats of the df:
          start_year  runtime_minutes  averagerating      numvotes
count  146144.000000    114405.000000   73856.000000  7.385600e+04
mean     2014.621798        86.187247       6.332729  3.523662e+03
std         2.733583       166.360590       1.474978  3.029402e+04
min      2010.000000         1.000000       1.000000  5.000000e+00
25%      2012.000000        70.000000       5.500000  1.400000e+01
50%      2015.000000        87.000000       6.500000  4.900000e+01
75%      2017.000000        99.000000       7.400000  2.820000e+02
max      2115.000000     51420.000000      10.000000  1.841066e+06
The columns of the dataframe are:
Index(['movie_id', 'primary_title', 'original_title', 'start_year',
       'runtime_minutes', 'genres', 'averagerating', 'numvotes'],
      dtype='object')

Now that we have a feel of the movie_basics, well also explore movie_ratings table

In [58]:
query2 = ("""
    SELECT * 
    FROM movie_ratings
    ;
        """)
df2 = pd.read_sql(query2,conn)
df2.head()

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [59]:
#We will call the function dataframe preview to view the info in the dataframe
dataframe_preview(df2)

The shape of the dataframe:
(73856, 3)


The data in the dataframe:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB
None


The descriptive stats of the df:
       averagerating      numvotes
count   73856.000000  7.385600e+04
mean        6.332729  3.523662e+03
std         1.474978  3.029402e+04
min         1.000000  5.000000e+00
25%         5.500000  1.400000e+01
50%         6.500000  4.900000e+01
75%         7.400000  2.820000e+02
max        10.000000  1.841066e+06
The columns of the dataframe are:
Index(['movie_id', 'averagerating', 'numvotes'], dtype='object')